<?php
  
if (!is_panel()){
  
  /*
  ---------------------------------
  Подвал сайта со всеми настройками
  ---------------------------------
  */
  
  //Подгрузка плагинов
  direct::components(ROOT.'/system/connections/cfooter/', 0);
  
  //Подключаем подвал в зависимости от выбранной версии сайта
  require (ROOT.'/style/version/'.version('DIR').'/includes/footer.php');
  
}elseif (is_panel() && user('ID') > 0) {
  
  /*
  ---------------------------------------------
  Подвал панели управления со всеми настройками
  ---------------------------------------------
  */
  
  //Подключаем подвал в зависимости от выбранной версии панели управления
  require (ROOT.'/panel/style/'.VERSION.'/includes/footer.php');
  
}

ob_end_flush();